package org.orient.otc.quote.exeption;

import lombok.AllArgsConstructor;
import lombok.Getter;
import org.orient.otc.common.core.exception.BaseExceptionAssert;

/**
 * 交易模块异常信息
 */
@Getter
@AllArgsConstructor
public enum BussinessException implements BaseExceptionAssert {
    /**
     * 数据异常
     */
    E_300100(300100, "数据异常"),
    /**
     * 参数缺失
     */
    E_300101(300101, "参数缺失"),
    /**
     * 参数错误
     */
    E_300102(300102, "参数错误"),
    /**
     * 波动率异常
     */
    E_300103(300103, "波动率异常"),
    /**
     * 模板名称不能重复
     */
    E_300104(300104, "模板名称不能重复"),
    /**
     * 合约涨跌停为空，请先维护合约涨跌停
     */
    E_300001(300001, "合约涨跌停为空，请先维护合约涨跌停"),
    /**
     * 非主力合约不允许修改波动率
     */
    E_300005(300105, "非主力合约不允许修改波动率"),

    /**
     * 模板已经被删除，请确认数据是否正常
     */
    E_300006(300006, "模板已经被删除，请确认数据是否正常"),
    /**
     * 交易记录不存在，请确认数据是否正常
     */
    E_300200(300200, "交易记录不存在，请确认数据是否正常"),
    /**
     * 已经观察过的累计期权不允许修改
     */
    E_300201(300201, "已经观察过的累计期权不允许修改"),
    /**
     * 不能修改非当前交易日的交易记录
     */
    E_300202(300202, "不能修改非当前交易日的交易记录"),
    /**
     * 到期平仓必须全部平完
     */
    E_300105(300105, "到期平仓必须全部平完"),

    /**
     * 到期日期 必须小于等于 标的到期日
     */
    E_300106(300106, "到期日期 必须小于等于 标的到期日"),
    /**
     * 还有平仓记录不允许修改
     */
    E_300107(300107, "还有平仓记录不允许修改"),
    /**
     * 有平仓记录的开仓不能删除
     */
    E_300108(300108, "有平仓记录的开仓不能删除"),

    /**
     * 交易日期应该小于或等于到期日期
     */
    E_300109(300109, "交易日期应该小于或等于到期日期"),
    /**
     * 敲出价格必须大于0
     */
    E_300112(300110,"敲出价格必须大于0"),
    /**
     * 组合编号不存在，请确认数据是否正常
     */
    E_300211(300211, "组合编号不存在，请确认数据是否正常"),
    /**
     * 交易记录不存在，请确认数据是否正常
     */
    E_300212(300212, "交易记录不存在，请确认数据是否正常"),
    //平仓部分
    /**
     * 平仓记录不存在
     */
    E_300300(300300, "平仓记录不存在"),
    /**
     * 不能回退非当前交易日的平仓记录
     */
    E_300301(300301, "不能回退非当前交易日的平仓记录"),
    /**
     * 简讯信息不存在
     */
    //简讯部分
    E_300401(300401, "简讯信息不存在"),
    /**
     * 合约代码不存在
     */

    E_300303(300103, "合约代码不存在"),

    //结算部分
    /**
     * 收盘价未落库不允许生成远期
     */
    E_300501(300501, "收盘价未落库"),
    /**
     * 调用python异常
     */
    E_300502(300502, "调用python异常"),
    /**
     * 仅允许调整近一周的场内交易
     */
    E_300503(300503, "仅允许调整近一周的场内交易"),

    /**
     * 邮件发送异常
     */
    E_300504(300504, "发送邮件异常"),

    /**
     * 资金状态为已确认，不能删除
     */
    E_300505(300505, "资金状态为已确认，不能删除"),
    /**
     * 资金状态为已确认，不能删除
     */
    E_300506(300506, "资金流水未匹配到银行卡"),
    ;

    /**
     * 返回码
     */
    private final int code;
    /**
     * 返回消息
     */
    private final String message;
}
